Revit 2027 API
DocumentChangedEventArgs.GetAddedElementIds Method
Overload List
Name | Description
GetAddedElementIds() |  Returns set of elements newly added to the document.
GetAddedElementIds(ElementFilter) |  Returns set of newly added elements that pass the filter.
Top
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace